Autodesk.Revit.DB.ProjectLocation.Duplicate(System.String)
Generate a copy of this project location with the specified name.
name: The name to be assigned to the duplicated project location.
Returns: If successful a duplicate of this project location object with the specified name.
Remarks: The name must not be the same as any existing site location objects.

Autodesk.Revit.DB.ProjectLocation.Name
The name of the project location.
Remarks: This property is used to get or set the name of the project location.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when failing to set the name (for example, because it is not unique).

Autodesk.Revit.DB.ProjectLocation
An object that represents a named location in a project.
Remarks: Revit Architecture projects can have named locations. A named location is the position of a model instance
in a Revit Architecture project. By default, each Revit Architecture project contains at least
one named location, called Internal.  Existing ProjectLocation objects can be found by using the
ProjectLocations property on the Document object. New project locations can be created by duplicating
an existing project location using the Duplicate method, and modifying the location's project position.